/*===================================================================== Projeto Robô Autoônomo Embarcado ================================================================================================
  
  Projeto de Firmware para Controle do Sistema do Robô Autônomo Desviador de Obstáculos
  
  First Comitt Date: 25/11/2025
  
  Last Firmware Update Data: 26/11/2011
  
  Firware Version: 1.2.0
  
  Author: João Pedro Rey
  
============================================================================= Bibliotecas Utilizadas ===================================================================================================*/

#include "FSM.h"
#include "UART.h"
#include "MOTOR.h"

/*============================================================================= Variáveis Globais ======================================================================================================*/

volatile uint8_t UART_BYTE;	//Variável de armazenamento do byte recebido no pino RX

/*=============================================================================== Main Function=========================================================================================================*/


int main(void)
{
	cli();
	
	PWM_INIT	();
	UART_INIT	();	
	MOTOR_INIT	();	
	TIMER_INIT	();	
	FSM_INIT	();

	sei();	
	
		
    while (1) 
    {
		FSM_UPDATE(&UART_BYTE);
		
		STATE_UPDATE();
		
    }/*End while*/
	
	return 0;
		
}/*End main function*/

/*======================================================================================================================================================================================================*/
